src/cf/InformationRegisters/ИсторияРегистрацийВОрганеПФР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ИсторияРегистрацийВОрганеПФР</Name>
			<InformationRegisterPeriodicity>Quarter</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РегистрационныйНомерПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ИсторияРегистрацийВОрганеПФР/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ДатаОтсчетаПериодическихСведений() Экспорт
	
	Возврат НачалоКвартала(ЗарплатаКадрыКлиентСервер.ДатаОтсчетаПериодическихСведений());
	
КонецФункции

Процедура ОбновитьИсторию(Организация, РегистрационныйНомерПФР) Экспорт
	
	СтруктураРегистра = УчетЗарплаты.НовыйСтруктураРегистраДляОбновленияИстории();
	СтруктураРегистра.ИмяРегистра            = "ИсторияРегистрацийВОрганеПФР";
	СтруктураРегистра.ПериодАктуальнойЗаписи = ДатаОтсчетаПериодическихСведений();
	СтруктураРегистра.ИмяИзмерения           = "Организация";
	СтруктураРегистра.ИмяРесурса             = "РегистрационныйНомерПФР";
	
	УчетЗарплаты.ОбновитьИсторию(СтруктураРегистра, Организация, РегистрационныйНомерПФР);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
